spring-ws-core/src/test/resources/org/springframework/ws/soap/server/endpoint/interceptor/multipleNamespaces.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
    <soapenv:Body>
		<r:GetAllRuleSetsRequest
				xmlns:r="http://springframework.org/spring-ws"/>
    </soapenv:Body>
</soapenv:Envelope>